# Midland Basin Well Data

## Import dependencies and load data

In [2]:
import pandas as pd
import numpy as np

In [3]:
# CSV Path
path = "Resources\Midland Basin Wells Header Data clean.csv"

In [4]:
# Read from CSV
engine = create_engine(db_string)

NameError: name 'create_engine' is not defined

In [5]:
# Load the data as a dataframe
df = pd.read_csv(path)
df.head()

,well id,Lease Name,Well Number,Operator compnay,County,Landing Zone,Surf Lat,Surf Long,BH Lat,BH Long,...,Date Completed,Total Fluid (bbl),Total Proppant (lb),"Well Spacing, ft",Well Name,Fluid (bbl/ft),Prop (lb/ft),Avg PPG,"Oil EUR, Mbbl","Gas EUR, MMcf"
0,42329418360000,BRADFORD TRUST A UNIT 3,1513AH,XTO ENERGY INC,MIDLAND,WCMP A,31.738410,-102.009040,31.715650,-102.003820,...,10/5/2018,17406252.0,10804000.0,NaN,BRADFORD TRUST A UNIT 3 1513AH,54.0,1412.0,0.62,208.0,3005.0
1,42329418710000,WARFIELD EAST C,103LS,DIAMONDBACK EXPLORATION & PROD LLC,MIDLAND,SPBYL SH,31.922233,-102.224514,31.892186,-102.214750,...,6/5/2018,NaN,NaN,NaN,WARFIELD EAST C 103LS,NaN,NaN,NaN,758.0,932.0
2,42329418760000,ST,4043WA,DIAMONDBACK EXPLORATION & PROD LLC,MIDLAND,WCMP A,31.982514,-102.211939,31.955094,-102.205336,...,5/25/2018,15855777.0,16090000.0,NaN,ST 4043WA,37.0,1585.0,1.01,456.0,1758.0
3,42329418860000,MUSTANG,H120UH,PERMIAN DEEP ROCK OIL CO LLC,MIDLAND,WCMP D,31.972125,-102.067947,31.997833,-102.076536,...,9/5/2018,16382508.0,20288000.0,NaN,MUSTANG H120UH,42.0,2197.0,1.24,858.0,1556.0
4,42329418890000,GBG 41/38 UNIT,0032LS,CHEVRON U S A INC,MIDLAND,SPBYL SH,31.853160,-102.129826,31.879517,-102.140645,...,6/26/2018,21463544.0,20104000.0,NaN,GBG 41/38 UNIT 0032LS,52.0,2052.0,0.94,759.0,1338.0

In [6]:
# Summarize initial dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14702 entries, 0 to 14701
Data columns (total 22 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   well id              14702 non-null  int64
 1   Lease Name           14702 non-null  object
 2   Well Number          14702 non-null  object
 3   Operator compnay     14702 non-null  object
 4   County               14702 non-null  object
 5   Landing Zone         14176 non-null  object
 6   Surf Lat             14702 non-null  float64
 7   Surf Long            14702 non-null  float64
 8   BH Lat               14309 non-null  float64
 9   BH Long              14309 non-null  float64
 10  Date Spud            14392 non-null  object
 11  Lateral Len (ft)     12126 non-null  float64
 12  Date Completed       12747 non-null  object
 13  Total Fluid (bbl)    11634 non-null  float64
 14  Total Proppant (lb)  11541 non-null  float64
 15  Well Spacing, ft     0 non-null      float64
 16  Well Name            14702 non-null  object
 17  Fluid (bbl/ft)       11181 non-null  float64
 18  Prop (lb/ft)         11096 non-null  float64
 19  Avg PPG              11057 non-null  float64
 20  Oil EUR, Mbbl        7338 non-null   float64
 21  Gas EUR, MMcf        7338 non-null   float64
dtypes: float64(13), int64(1), object(8)
memory usage: 2.5+ MB

## Data Cleaning

In [9]:
# Drop the columns where all values are null
df = df[["well id","Surf Lat",'Surf Long',"BH Lat","BH Long"]]
df.head()

          well id   Surf Lat   Surf Long     BH Lat     BH Long
0  42329418360000  31.738410 -102.009040  31.715650 -102.003820
1  42329418710000  31.922233 -102.224514  31.892186 -102.214750
2  42329418760000  31.982514 -102.211939  31.955094 -102.205336
3  42329418860000  31.972125 -102.067947  31.997833 -102.076536
4  42329418890000  31.853160 -102.129826  31.879517 -102.140645

In [11]:
df["Mid Point Lat"] = (df["Surf Lat"] + df["BH Lat"])/2
df["Mid Point Long"] = (df["Surf Long"] + df["BH Long"])/2
df.head()

,well id,Surf Lat,Surf Long,BH Lat,BH Long,Mid Point Lat,Mid Point Long
0,42329418360000,31.738410,-102.009040,31.715650,-102.003820,31.727030,-102.006430
1,42329418710000,31.922233,-102.224514,31.892186,-102.214750,31.907210,-102.219632
2,42329418760000,31.982514,-102.211939,31.955094,-102.205336,31.968804,-102.208638
3,42329418860000,31.972125,-102.067947,31.997833,-102.076536,31.984979,-102.072242
4,42329418890000,31.853160,-102.129826,31.879517,-102.140645,31.866338,-102.135235

In [ ]:
def calc_dist()
    



return